# PipeSettings Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PipeSettings Class
Members See Also
---
The pipe setting class.
**Namespace:** Autodesk.Revit.DB.Plumbing**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public class PipeSettings : Element
```

Visual Basic
---
```text
Public Class PipeSettings _
	Inherits Element
```

Visual C++
---
```text
public ref class PipeSettings : public Element
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB.Plumbing..::..PipeSettings
# See Also
PipeSettings Members
Autodesk.Revit.DB.Plumbing Namespace